In [2]:
import pandas as pd

In [3]:
import numpy as np

In [126]:
import matplotlib.pyplot as plt

In [4]:
# Creating Pandas series

array=[1,2,3,4]
x=pd.Series(array)

In [5]:
x

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
# Dictionary into pandas

dict={'a':2,'b':7,'c':90}
y=pd.Series(dict)

In [7]:
y

a     2
b     7
c    90
dtype: int64

In [8]:
# Creating dataFrame

data={'Name':['Asad','Konchi','Laili','Fuda','Chikni','Valluk','Saddam Shot','Tugitt'],
      'Gender':['Male','Male','Female','Male','Female','Male','Male','Male'],
      'Age':[27,26,39,25,30,27,90,35],
      'Hobby':['Pinik','Pinik','Drug Dealer','Bitik','Past Crush','Bitik','Fucking Slut','Fucking Boudi']
      
      }

In [9]:
data

{'Name': ['Asad',
  'Konchi',
  'Laili',
  'Fuda',
  'Chikni',
  'Valluk',
  'Saddam Shot',
  'Tugitt'],
 'Gender': ['Male',
  'Male',
  'Female',
  'Male',
  'Female',
  'Male',
  'Male',
  'Male'],
 'Age': [27, 26, 39, 25, 30, 27, 90, 35],
 'Hobby': ['Pinik',
  'Pinik',
  'Drug Dealer',
  'Bitik',
  'Past Crush',
  'Bitik',
  'Fucking Slut',
  'Fucking Boudi']}

In [10]:
df=pd.DataFrame(data)

In [11]:
df

          Name  Gender  Age          Hobby
0         Asad    Male   27          Pinik
1       Konchi    Male   26          Pinik
2        Laili  Female   39    Drug Dealer
3         Fuda    Male   25          Bitik
4       Chikni  Female   30     Past Crush
5       Valluk    Male   27          Bitik
6  Saddam Shot    Male   90   Fucking Slut
7       Tugitt    Male   35  Fucking Boudi

In [12]:
df.isnull()

    Name  Gender    Age  Hobby
0  False   False  False  False
1  False   False  False  False
2  False   False  False  False
3  False   False  False  False
4  False   False  False  False
5  False   False  False  False
6  False   False  False  False
7  False   False  False  False

In [13]:
df['Age'].mean()

np.float64(37.375)

In [14]:
df['Age'].min()

np.int64(25)

In [15]:
df['Age'].max()

np.int64(90)

In [16]:
df['Age']>=30

0    False
1    False
2     True
3    False
4     True
5    False
6     True
7     True
Name: Age, dtype: bool

In [17]:
df['Cum_Age']=df['Age']

In [18]:
df

          Name  Gender  Age          Hobby  Cum_Age
0         Asad    Male   27          Pinik       27
1       Konchi    Male   26          Pinik       26
2        Laili  Female   39    Drug Dealer       39
3         Fuda    Male   25          Bitik       25
4       Chikni  Female   30     Past Crush       30
5       Valluk    Male   27          Bitik       27
6  Saddam Shot    Male   90   Fucking Slut       90
7       Tugitt    Male   35  Fucking Boudi       35

In [19]:
df['Cum_Age']=df['Age'].cumsum()

In [20]:
df

          Name  Gender  Age          Hobby  Cum_Age
0         Asad    Male   27          Pinik       27
1       Konchi    Male   26          Pinik       53
2        Laili  Female   39    Drug Dealer       92
3         Fuda    Male   25          Bitik      117
4       Chikni  Female   30     Past Crush      147
5       Valluk    Male   27          Bitik      174
6  Saddam Shot    Male   90   Fucking Slut      264
7       Tugitt    Male   35  Fucking Boudi      299

In [21]:
df.head(2)

     Name Gender  Age  Hobby  Cum_Age
0    Asad   Male   27  Pinik       27
1  Konchi   Male   26  Pinik       53

In [22]:
df.tail(3)

          Name Gender  Age          Hobby  Cum_Age
5       Valluk   Male   27          Bitik      174
6  Saddam Shot   Male   90   Fucking Slut      264
7       Tugitt   Male   35  Fucking Boudi      299

In [23]:
df['Gender'].value_counts()   #Total no. of male and female

Gender
Male      6
Female    2
Name: count, dtype: int64

In [24]:
df['Sex']='Male'

In [25]:
df['Sex']

0    Male
1    Male
2    Male
3    Male
4    Male
5    Male
6    Male
7    Male
Name: Sex, dtype: object

In [26]:
df[df['Gender']=='Male']     # If we want to view the list of only male

          Name Gender  Age          Hobby  Cum_Age   Sex
0         Asad   Male   27          Pinik       27  Male
1       Konchi   Male   26          Pinik       53  Male
3         Fuda   Male   25          Bitik      117  Male
5       Valluk   Male   27          Bitik      174  Male
6  Saddam Shot   Male   90   Fucking Slut      264  Male
7       Tugitt   Male   35  Fucking Boudi      299  Male

In [27]:
df1=df['Age']

In [28]:
df1

0    27
1    26
2    39
3    25
4    30
5    27
6    90
7    35
Name: Age, dtype: int64

In [29]:
df2=df[['Age','Cum_Age']]

In [30]:
df2

   Age  Cum_Age
0   27       27
1   26       53
2   39       92
3   25      117
4   30      147
5   27      174
6   90      264
7   35      299

In [31]:
df2=df[['Age','Cum_Age']].corr()

In [32]:
df2

              Age   Cum_Age
Age      1.000000  0.552751
Cum_Age  0.552751  1.000000

In [33]:
df[df['Gender']=='Female']

     Name  Gender  Age        Hobby  Cum_Age   Sex
2   Laili  Female   39  Drug Dealer       92  Male
4  Chikni  Female   30   Past Crush      147  Male

In [34]:
df['Cum_Hobby']=df['Hobby'].cumsum()

In [35]:
df

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby
0,Asad,Male,27,Pinik,27,Male,Pinik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...

In [36]:
df['Dup_Age']=df['Age']

In [37]:
df

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age
0,Asad,Male,27,Pinik,27,Male,Pinik,27
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35

In [38]:
df['Dup_Hobby']=df['Hobby']

In [39]:
df

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age,Dup_Hobby
0,Asad,Male,27,Pinik,27,Male,Pinik,27,Pinik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26,Pinik
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39,Drug Dealer
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25,Bitik
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30,Past Crush
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27,Bitik
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90,Fucking Slut
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35,Fucking Boudi

# Sorting

In [40]:
df_sorted = df.sort_values(by='Age')

In [41]:
df_sorted

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age,Dup_Hobby
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25,Bitik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26,Pinik
0,Asad,Male,27,Pinik,27,Male,Pinik,27,Pinik
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27,Bitik
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30,Past Crush
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35,Fucking Boudi
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39,Drug Dealer
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90,Fucking Slut

In [45]:
df.sort_values(by='Age',ascending=False)

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age,Dup_Hobby
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90,Fucking Slut
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39,Drug Dealer
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35,Fucking Boudi
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30,Past Crush
0,Asad,Male,27,Pinik,27,Male,Pinik,27,Pinik
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27,Bitik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26,Pinik
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25,Bitik

In [46]:
df.sort_values(by='Age',ascending=True)

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age,Dup_Hobby
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25,Bitik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26,Pinik
0,Asad,Male,27,Pinik,27,Male,Pinik,27,Pinik
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27,Bitik
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30,Past Crush
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35,Fucking Boudi
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39,Drug Dealer
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90,Fucking Slut

In [44]:
df.sort_values(by='Dup_Hobby',ascending=False)

,Name,Gender,Age,Hobby,Cum_Age,Sex,Cum_Hobby,Dup_Age,Dup_Hobby
0,Asad,Male,27,Pinik,27,Male,Pinik,27,Pinik
1,Konchi,Male,26,Pinik,53,Male,PinikPinik,26,Pinik
4,Chikni,Female,30,Past Crush,147,Male,PinikPinikDrug DealerBitikPast Crush,30,Past Crush
6,Saddam Shot,Male,90,Fucking Slut,264,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,90,Fucking Slut
7,Tugitt,Male,35,Fucking Boudi,299,Male,PinikPinikDrug DealerBitikPast CrushBitikFucki...,35,Fucking Boudi
2,Laili,Female,39,Drug Dealer,92,Male,PinikPinikDrug Dealer,39,Drug Dealer
3,Fuda,Male,25,Bitik,117,Male,PinikPinikDrug DealerBitik,25,Bitik
5,Valluk,Male,27,Bitik,174,Male,PinikPinikDrug DealerBitikPast CrushBitik,27,Bitik

In [47]:
df.sort_values(by='Age',ascending=True,inplace=True)

In [48]:
df2

              Age   Cum_Age
Age      1.000000  0.552751
Cum_Age  0.552751  1.000000

In [49]:
df2.sort_values(by='Age',inplace=True)

In [50]:
df2

              Age   Cum_Age
Cum_Age  0.552751  1.000000
Age      1.000000  0.552751

# Changing Values

In [51]:
df['Age'].fillna(df['Age'].mean())

3    25
1    26
0    27
5    27
4    30
7    35
2    39
6    90
Name: Age, dtype: int64

In [52]:
c=df['Age'].fillna(df['Age'].mean())

In [53]:
type(c)

pandas.core.series.Series

In [60]:
data={'Name':['Asad',np.nan,'Laili','Fuda',np.nan,'Valluk','Saddam Shot','Tugitt'],
      'Gender':['Male','Male',np.nan,'Male','Female',np.nan,'Male','Male'],
      'Age':[27,26,39,np.nan,30,27,np.nan,35],
      'Hobby':['Pinik',np.nan,'Drug Dealer','Bitik',np.nan,'Bitik','Fucking Slut','Fucking Boudi']
      
      }

In [61]:
df=pd.DataFrame(data)

In [62]:
df

          Name  Gender   Age          Hobby
0         Asad    Male  27.0          Pinik
1          NaN    Male  26.0            NaN
2        Laili     NaN  39.0    Drug Dealer
3         Fuda    Male   NaN          Bitik
4          NaN  Female  30.0            NaN
5       Valluk     NaN  27.0          Bitik
6  Saddam Shot    Male   NaN   Fucking Slut
7       Tugitt    Male  35.0  Fucking Boudi

In [63]:
df['Age']

0    27.0
1    26.0
2    39.0
3     NaN
4    30.0
5    27.0
6     NaN
7    35.0
Name: Age, dtype: float64

In [65]:
df['Age'].fillna(df['Age'])

0    27.0
1    26.0
2    39.0
3     NaN
4    30.0
5    27.0
6     NaN
7    35.0
Name: Age, dtype: float64

In [66]:
df['Age'].fillna(df['Age'].mean())

0    27.000000
1    26.000000
2    39.000000
3    30.666667
4    30.000000
5    27.000000
6    30.666667
7    35.000000
Name: Age, dtype: float64

In [67]:
df['Age'].fillna

<bound method NDFrame.fillna of 0    27.0
1    26.0
2    39.0
3     NaN
4    30.0
5    27.0
6     NaN
7    35.0
Name: Age, dtype: float64>

In [68]:
df['Age'].fillna(df['Age'].mean())

0    27.000000
1    26.000000
2    39.000000
3    30.666667
4    30.000000
5    27.000000
6    30.666667
7    35.000000
Name: Age, dtype: float64

In [86]:
df['Gender'].fillna(df['Gender'].mode()[0],inplace=True)

In [83]:
df['Gender']

0      Male
1      Male
2      Male
3      Male
4    Female
5      Male
6      Male
7      Male
Name: Gender, dtype: object

In [87]:
df['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [89]:
df

          Name  Gender   Age          Hobby
0         Asad    Male  27.0          Pinik
1          NaN    Male  26.0            NaN
2        Laili    Male  39.0    Drug Dealer
3         Fuda    Male   NaN          Bitik
4          NaN  Female  30.0            NaN
5       Valluk    Male  27.0          Bitik
6  Saddam Shot    Male   NaN   Fucking Slut
7       Tugitt    Male  35.0  Fucking Boudi

In [90]:
df['Gender'].fillna(df['Gender'].mode()[0], inplace=True)

In [91]:
df['Gender']

0      Male
1      Male
2      Male
3      Male
4    Female
5      Male
6      Male
7      Male
Name: Gender, dtype: object

In [93]:
df['Age'].mode()

0    27.0
Name: Age, dtype: float64

In [94]:
df['Gender'].mode()

0    Male
Name: Gender, dtype: object

In [95]:
df['Age'].mean()

np.float64(30.666666666666668)

In [96]:
df

          Name  Gender   Age          Hobby
0         Asad    Male  27.0          Pinik
1          NaN    Male  26.0            NaN
2        Laili    Male  39.0    Drug Dealer
3         Fuda    Male   NaN          Bitik
4          NaN  Female  30.0            NaN
5       Valluk    Male  27.0          Bitik
6  Saddam Shot    Male   NaN   Fucking Slut
7       Tugitt    Male  35.0  Fucking Boudi

In [97]:
df['Name'].fillna(df['Name'].mode(),inplace=True)

In [98]:
df['Name']

0           Asad
1           Fuda
2          Laili
3           Fuda
4         Tugitt
5         Valluk
6    Saddam Shot
7         Tugitt
Name: Name, dtype: object

In [99]:
df

          Name  Gender   Age          Hobby
0         Asad    Male  27.0          Pinik
1         Fuda    Male  26.0            NaN
2        Laili    Male  39.0    Drug Dealer
3         Fuda    Male   NaN          Bitik
4       Tugitt  Female  30.0            NaN
5       Valluk    Male  27.0          Bitik
6  Saddam Shot    Male   NaN   Fucking Slut
7       Tugitt    Male  35.0  Fucking Boudi

In [100]:
df['Age'].fillna(df['Age'].mean())

0    27.000000
1    26.000000
2    39.000000
3    30.666667
4    30.000000
5    27.000000
6    30.666667
7    35.000000
Name: Age, dtype: float64

In [101]:
df['Age']

0    27.0
1    26.0
2    39.0
3     NaN
4    30.0
5    27.0
6     NaN
7    35.0
Name: Age, dtype: float64

In [102]:
df['Age']=df['Age'].fillna(df['Age'].mean())

In [103]:
df['Age']

0    27.000000
1    26.000000
2    39.000000
3    30.666667
4    30.000000
5    27.000000
6    30.666667
7    35.000000
Name: Age, dtype: float64

In [104]:
df

          Name  Gender        Age          Hobby
0         Asad    Male  27.000000          Pinik
1         Fuda    Male  26.000000            NaN
2        Laili    Male  39.000000    Drug Dealer
3         Fuda    Male  30.666667          Bitik
4       Tugitt  Female  30.000000            NaN
5       Valluk    Male  27.000000          Bitik
6  Saddam Shot    Male  30.666667   Fucking Slut
7       Tugitt    Male  35.000000  Fucking Boudi

In [119]:
if not df['Hobby'].mode().empty:
    df['Hobby'].fillna(df['Hobby'].mode()[0], inplace=True)
else:
    print("No mode found for the 'Hobby' column.")

print(df)

No mode found for the 'Hobby' column.
          Name  Gender        Age Hobby
0         Asad    Male  27.000000  None
1         Fuda    Male  26.000000  None
2        Laili    Male  39.000000  None
3         Fuda    Male  30.666667  None
4       Tugitt  Female  30.000000  None
5       Valluk    Male  27.000000  None
6  Saddam Shot    Male  30.666667  None
7       Tugitt    Male  35.000000  None

In [120]:
df

          Name  Gender        Age Hobby
0         Asad    Male  27.000000  None
1         Fuda    Male  26.000000  None
2        Laili    Male  39.000000  None
3         Fuda    Male  30.666667  None
4       Tugitt  Female  30.000000  None
5       Valluk    Male  27.000000  None
6  Saddam Shot    Male  30.666667  None
7       Tugitt    Male  35.000000  None

# Maping

In [121]:
data={'Name':['Asad','konchi','Laili','Fuda','Chikni','Valluk','Saddam Shot','Tugitt'],
      'Gender':['Male','Male','Female','Male','Female','Male','Male','Male'],
      'Age':[27,26,39,26,30,27,90,35],
      'Hobby':['Pinik','Pinik','Drug Dealer','Bitik','Past Crush','Bitik','Fucking Slut','Fucking Boudi']
      
      }

In [122]:
df=pd.DataFrame(data)

In [124]:
df['Gender_maping']=df['Gender'].map({'Male':1,'Female':0})

In [125]:
df

          Name  Gender  Age          Hobby  Gender_maping
0         Asad    Male   27          Pinik              1
1       konchi    Male   26          Pinik              1
2        Laili  Female   39    Drug Dealer              0
3         Fuda    Male   26          Bitik              1
4       Chikni  Female   30     Past Crush              0
5       Valluk    Male   27          Bitik              1
6  Saddam Shot    Male   90   Fucking Slut              1
7       Tugitt    Male   35  Fucking Boudi              1